#!/bin/bash
################################################################################
# SNSトピック作成スクリプト
#
# - トピック名: ts-010-sns-010
################################################################################
set -euo pipefail
MY_NAME=${0##*/}
LOG_PATH=./${MY_NAME}.log

exec >> "${LOG_PATH}" 2>&1

# --- 設定 --- #
TOPIC_NAME="ts-010-sns-010"

################################################################################
# 確認
################################################################################
confirm_topic() {
  echo "############################################################"
  echo "# SNSトピック [$TOPIC_NAME] の設定確認"
  echo "############################################################"
  
  aws sns list-topics | grep "$TOPIC_NAME" || echo "SNSトピック [$TOPIC_NAME] は存在しません。"
  echo
}

################################################################################
# 作成処理
################################################################################
create_topic() {
  echo "############################################################"
  echo "# SNSトピック [$TOPIC_NAME] の作成処理"
  echo "############################################################"

  if aws sns list-topics | grep -q "$TOPIC_NAME"; then
    echo "SNSトピック [$TOPIC_NAME] は既に存在します。削除して再作成します。"
    TOPIC_ARN=$(aws sns list-topics --query 'Topics[].TopicArn' --output text | tr '\t' '\n' | grep "${TOPIC_NAME}")
    aws sns delete-topic --topic-arn "$TOPIC_ARN"
    echo "SNSトピック [$TOPIC_NAME] を削除しました。"
  fi
  echo "SNSトピック [$TOPIC_NAME] を新規作成します。"
  TOPIC_ARN=$(aws sns create-topic --name "$TOPIC_NAME" --query 'TopicArn' --output text)
  
  echo "処理完了。トピックARN: $TOPIC_ARN"
  echo
}

################################################################################
# メイン処理
################################################################################
echo "実行開始: $(date)"
echo "------------------------------------------------------------"

confirm_topic
create_topic
confirm_topic

echo "------------------------------------------------------------"
echo "実行終了: $(date)"

exit 0
